{
  "backend/main.mo": "Main Motoko actor implementing user profile management and finance entry CRUD operations with access control, including addFinanceEntry, updateFinanceEntry, deleteFinanceEntry, and query functions for retrieving entries by owner, date range, and type.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: adding delete button icons to finance entries in FinanceSection component and connecting them to backend delete mutation with React Query optimistic updates.",
  "frontend-file-summaries.txt": "JSON object containing summaries of all frontend files, including hooks, components, utilities, and configuration files for the finance tracker application with vessel tracking legacy references.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark modes, including finance-specific colors for income, expense, and saving categories.",
  "frontend/index.html": "HTML entry point for the React application with title 'Mani Track' and root div mounting point.",
  "frontend/src/App.tsx": "Main React application component with QueryClientProvider, authentication flow, conditional profile setup modal, finance entry form, comparison chart, and dashboard with time period selection.",
  "frontend/src/components/ComparisonChart.tsx": "Bar chart component using Recharts to visualize income, expenses, and savings comparison over daily, monthly, or yearly periods with responsive design and loading states.",
  "frontend/src/components/FinanceDashboard.tsx": "Dashboard component displaying total income, expenses, and savings summary cards with three FinanceSection components showing aggregated data by selected time period.",
  "frontend/src/components/FinanceEntryForm.tsx": "Form component for adding/updating finance entries with validation, supporting income/expense/saving types, date picker, and category input. Uses React Hook Form pattern with local state and mutation hooks for submission.",
  "frontend/src/components/FinanceSection.tsx": "Displays aggregated finance entries (income/expense/saving) grouped by time period with delete functionality. Shows entries in a scrollable card with color-coded styling based on entry type.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login/logout states using Internet Identity. Handles authentication flow and clears query cache on logout.",
  "frontend/src/components/ProfileSetupModal.tsx": "Modal dialog for first-time user profile setup that prompts for name input. Non-dismissible modal that saves user profile via mutation hook.",
  "frontend/src/components/VesselForm.tsx": "Empty file with no content.",
  "frontend/src/components/VesselList.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages backend actor creation with authentication, handling both anonymous and authenticated states. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useFinanceQueries.ts": "Collection of React Query hooks for finance operations including CRUD operations for entries, user profile management, and filtering by date/type. All hooks depend on the actor from useActor.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context and hook for Internet Identity authentication, managing login/logout flow and identity state. Provides AuthClient wrapper with configurable options and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Empty file with no content.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a finance-themed color palette (income/expense/saving colors, chart colors) for both light and dark modes using OKLCH color space, plus custom shadow utilities.",
  "frontend/src/lib/utils.ts": "Utility function `cn()` that combines clsx and tailwind-merge for conditional className merging in React components.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient provider for React Query and InternetIdentityProvider for authentication, then renders the App component.",
  "frontend/src/utils/chartDataFormatter.ts": "Formats finance entries into chart data points grouped by daily, monthly, or yearly periods, aggregating income/expense/saving amounts and returning the last 10 periods sorted chronologically.",
  "frontend/src/utils/financeAggregation.ts": "Aggregates finance entries by daily, monthly, or yearly periods, grouping entries by date key and calculating totals with entry details for each period.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and persisting URL parameters from both regular query strings and hash-based routing, with sessionStorage support for maintaining state across navigation and cleanup functions.",
  "frontend/tailwind.config.js": "Tailwind configuration extending the default theme with custom OKLCH-based color system for finance UI (income/expense/saving colors), custom border radius variables, finance-specific shadows, and container settings.",
  "project_state.json": "Project state tracking document showing evolution from vessel tracking to personal finance application, listing implemented features including finance entry forms, dashboard with time period views, comparison charts, and delete functionality."
}